artillery.yml
config:
    target: "https://rosser.cs.grinnell.edu:4433"
    http:
        timeout: 10
        tls:
            rejectUnauthorized: false
    phases:
        - arrivalRate: 20
          duration: 10
    payload:
        path: "paths.csv"
        fields:
            - "path"

scenarios:
    - flow:
        - get:
            url: "{{ path }}"